insert into proj_library.publisher values
('P0001', 'YES24'),
('P0002', '교보문고'),
('P0003', '학산문학사'),
('P0004', '동아출판'),
('P0005', '가메출판사'),
('P0006', '이지스퍼블리싱');

insert into proj_library.book values
('2220000101', 1, '조제 마우루 지 바스콘셀루스', '이천희', '나의 라임 오렌지 나무', 8000, 1, '나의라임 오렌지나무book.jpg', 2, 2, 2, 'P0001'),
('2220000102', 1, '조제 마우루 지 바스콘셀루스', '이천희', '나의 라임 오렌지 나무', 8000, 1, '나의라임 오렌지나무book.jpg', 2, 2, 2, 'P0001'),
('2220000103', 1, '조제 마우루 지 바스콘셀루스', '이천희', '나의 라임 오렌지 나무', 8000, 1, '나의라임 오렌지나무book.jpg', 2, 2, 2, 'P0001'),
('2220000104', 1, '조제 마우루 지 바스콘셀루스', '이천희', '나의 라임 오렌지 나무', 8000, 1, '나의라임 오렌지나무book.jpg', 2, 2, 2, 'P0001'),
('2220000105', 1, '조제 마우루 지 바스콘셀루스', '이천희', '나의 라임 오렌지 나무', 8000, 1, '나의라임 오렌지나무book.jpg', 2, 2, 2, 'P0001');

insert into proj_library.book values
('0390000201', 2, '한복선', '한복선', '한복선의 친절한 요리책', 16000, 1, '요리책.book.jpg', 9, 3, 0, 'P0005'),
('0390000202', 2, '한복선', '한복선', '한복선의 친절한 요리책', 16000, 1, '요리책.book.jpg', 9, 3, 0, 'P0005'),
('0390000203', 2, '한복선', '한복선', '한복선의 친절한 요리책', 16000, 1, '요리책.book.jpg', 9, 3, 0, 'P0005'),
('0390000204', 2, '한복선', '한복선', '한복선의 친절한 요리책', 16000, 1, '요리책.book.jpg', 9, 3, 0, 'P0005'),
('0390000205', 2, '한복선', '한복선', '한복선의 친절한 요리책', 16000, 1, '요리책.book.jpg', 9, 3, 0, 'P0005');

insert into proj_library.book values
('5600000301', 3, '정재곤', '정재곤', 'Do it! 안드로이드 앱 프로그래밍', 7300, 1, 'book3.jpg', 0, 6, 5, 'P0006'),
('5600000302', 3, '정재곤', '정재곤', 'Do it! 안드로이드 앱 프로그래밍', 7300, 1, 'book3.jpg', 0, 6, 5, 'P0006'),
('5600000303', 3, '정재곤', '정재곤', 'Do it! 안드로이드 앱 프로그래밍', 7300, 1, 'book3.jpg', 0, 6, 5, 'P0006'),
('5600000304', 3, '정재곤', '정재곤', 'Do it! 안드로이드 앱 프로그래밍', 7300, 1, 'book3.jpg', 0, 6, 5, 'P0006'),
('5600000305', 3, '정재곤', '정재곤', 'Do it! 안드로이드 앱 프로그래밍', 7300, 1, 'book3.jpg', 0, 6, 5, 'P0006');

insert into proj_library.book values
('6900000401', 4, '앙투안 드 생텍쥐페리', '김재영', '어린 왕자', 9000, 1, '어린왕자book.jpg', 0, 9, 6, 'P0004'),
('6900000402', 4, '앙투안 드 생텍쥐페리', '김재영', '어린 왕자', 9000, 1, '어린왕자book.jpg', 0, 9, 6, 'P0004'),
('6900000403', 4, '앙투안 드 생텍쥐페리', '김재영', '어린 왕자', 9000, 1, '어린왕자book.jpg', 0, 9, 6, 'P0004'),
('6900000404', 4, '앙투안 드 생텍쥐페리', '김재영', '어린 왕자', 9000, 1, '어린왕자book.jpg', 0, 9, 6, 'P0004'),
('6900000405', 4, '앙투안 드 생텍쥐페리', '김재영', '어린 왕자', 9000, 1, '어린왕자book.jpg', 0, 9, 6, 'P0004');

insert into proj_library.book values
('3890000501', 5, '조창인', '조창인', '등대지기', 9000, 1, '등대지기.book.jpg', 9, 8, 3, 'P0003'),
('3890000502', 5, '조창인', '조창인', '등대지기', 9000, 1, '등대지기.book.jpg', 9, 8, 3, 'P0003'),
('3890000503', 5, '조창인', '조창인', '등대지기', 9000, 1, '등대지기.book.jpg', 9, 8, 3, 'P0003'),
('3890000504', 5, '조창인', '조창인', '등대지기', 9000, 1, '등대지기.book.jpg', 9, 8, 3, 'P0003'),
('3890000505', 5, '조창인', '조창인', '등대지기', 9000, 1, '등대지기.book.jpg', 9, 8, 3, 'P0003');

insert into proj_library.book values
('1370000601', 6, '셸 실버스타인', '황경수', '아낌없이 주는 나무', 7300, 1, '아낌없이주는나무book.jpg', 7, 3, 1, 'P0001'),
('1370000602', 6, '셸 실버스타인', '황경수', '아낌없이 주는 나무', 7300, 1, '아낌없이주는나무book.jpg', 7, 3, 1, 'P0001'),
('1370000603', 6, '셸 실버스타인', '황경수', '아낌없이 주는 나무', 7300, 1, '아낌없이주는나무book.jpg', 7, 3, 1, 'P0001'),
('1370000604', 6, '셸 실버스타인', '황경수', '아낌없이 주는 나무', 7300, 1, '아낌없이주는나무book.jpg', 7, 3, 1, 'P0001'),
('1370000605', 6, '셸 실버스타인', '황경수', '아낌없이 주는 나무', 7300, 1, '아낌없이주는나무book.jpg', 7, 3, 1, 'P0001'),
('1370000606', 6, '셸 실버스타인', '황경수', '아낌없이 주는 나무', 7300, 1, '아낌없이주는나무book.jpg', 7, 3, 1, 'P0001'),
('1370000607', 6, '셸 실버스타인', '황경수', '아낌없이 주는 나무', 7300, 1, '아낌없이주는나무book.jpg', 7, 3, 1, 'P0001'),
('1370000608', 6, '셸 실버스타인', '황경수', '아낌없이 주는 나무', 7300, 1, '아낌없이주는나무book.jpg', 7, 3, 1, 'P0001');

insert into proj_library.book values
('6900000701', 7, '김민수', '김민수', '그림으로 쉽게 설명하는 안드로이드 프로그래밍', 8200, 1, 'book1.jpg', 0, 9, 6, 'P0004'),
('6900000702', 7, '김민수', '김민수', '그림으로 쉽게 설명하는 안드로이드 프로그래밍', 8200, 1, 'book1.jpg', 0, 9, 6, 'P0004'),
('6900000703', 7, '김민수', '김민수', '그림으로 쉽게 설명하는 안드로이드 프로그래밍', 8200, 1, 'book1.jpg', 0, 9, 6, 'P0004');

insert into proj_library.book values
('3990000801', 8, '키시모토 마사시', '김재원', '나루토 67권', 4000, 1, 'naruto.jpg', 9, 9, 3, 'P0005'),
('3990000802', 8, '키시모토 마사시', '김재원', '나루토 67권', 4000, 1, 'naruto.jpg', 9, 9, 3, 'P0005'),
('3990000803', 8, '키시모토 마사시', '김재원', '나루토 67권', 4000, 1, 'naruto.jpg', 9, 9, 3, 'P0005'),
('3990000804', 8, '키시모토 마사시', '김재원', '나루토 67권', 4000, 1, 'naruto.jpg', 9, 9, 3, 'P0005'),
('3990000805', 8, '키시모토 마사시', '김재원', '나루토 67권', 4000, 1, 'naruto.jpg', 9, 9, 3, 'P0005');

insert into proj_library.book values
('2440000901', 9, '히가시노 게이고', '양윤옥', '나미야 잡화점의 기적', 14800, 1, 'namiya.jpg', 4, 4, 2, 'P0002'),
('2440000902', 9, '히가시노 게이고', '양윤옥', '나미야 잡화점의 기적', 14800, 1, 'namiya.jpg', 4, 4, 2, 'P0002'),
('2440000903', 9, '히가시노 게이고', '양윤옥', '나미야 잡화점의 기적', 14800, 1, 'namiya.jpg', 4, 4, 2, 'P0002'),
('2440000904', 9, '히가시노 게이고', '양윤옥', '나미야 잡화점의 기적', 14800, 1, 'namiya.jpg', 4, 4, 2, 'P0002'),
('2440000905', 9, '히가시노 게이고', '양윤옥', '나미야 잡화점의 기적', 14800, 1, 'namiya.jpg', 4, 4, 2, 'P0002'),
('2440000906', 9, '히가시노 게이고', '양윤옥', '나미야 잡화점의 기적', 14800, 1, 'namiya.jpg', 4, 4, 2, 'P0002'),
('2440000907', 9, '히가시노 게이고', '양윤옥', '나미야 잡화점의 기적', 14800, 1, 'namiya.jpg', 4, 4, 2, 'P0002');

insert into proj_library.book values
('1840001001', 10, '스펜서 존슨', '공경희', '내 치즈는 어디에서 왔을까?', 13000, 1, 'book_cheese.jpg', 4, 8, 1, 'P0002'),
('1840001002', 10, '스펜서 존슨', '공경희', '내 치즈는 어디에서 왔을까?', 13000, 1, 'book_cheese.jpg', 4, 8, 1, 'P0002'),
('1840001003', 10, '스펜서 존슨', '공경희', '내 치즈는 어디에서 왔을까?', 13000, 1, 'book_cheese.jpg', 4, 8, 1, 'P0002'),
('1840001004', 10, '스펜서 존슨', '공경희', '내 치즈는 어디에서 왔을까?', 13000, 1, 'book_cheese.jpg', 4, 8, 1, 'P0002'),
('1840001005', 10, '스펜서 존슨', '공경희', '내 치즈는 어디에서 왔을까?', 13000, 1, 'book_cheese.jpg', 4, 8, 1, 'P0002'),
('1840001006', 10, '스펜서 존슨', '공경희', '내 치즈는 어디에서 왔을까?', 13000, 1, 'book_cheese.jpg', 4, 8, 1, 'P0002'),
('1840001007', 10, '스펜서 존슨', '공경희', '내 치즈는 어디에서 왔을까?', 13000, 1, 'book_cheese.jpg', 4, 8, 1, 'P0002');

insert into proj_library.book values
('3270001101', 11, '성선화', '김유라', '6개월 안에 천만원 모으기', 14800, 1, 'book_money.jpg', 7, 2, 3, 'P0005'),
('3270001102', 11, '성선화', '김유라', '6개월 안에 천만원 모으기', 14800, 1, 'book_money.jpg', 7, 2, 3, 'P0005'),
('3270001103', 11, '성선화', '김유라', '6개월 안에 천만원 모으기', 14800, 1, 'book_money.jpg', 7, 2, 3, 'P0005'),
('3270001104', 11, '성선화', '김유라', '6개월 안에 천만원 모으기', 14800, 1, 'book_money.jpg', 7, 2, 3, 'P0005'),
('3270001105', 11, '성선화', '김유라', '6개월 안에 천만원 모으기', 14800, 1, 'book_money.jpg', 7, 2, 3, 'P0005'),
('3270001106', 11, '성선화', '김유라', '6개월 안에 천만원 모으기', 14800, 1, 'book_money.jpg', 7, 2, 3, 'P0005'),
('3270001107', 11, '성선화', '김유라', '6개월 안에 천만원 모으기', 14800, 1, 'book_money.jpg', 7, 2, 3, 'P0005');

insert into proj_library.book values
('3860001201', 12, '강진희', '이준희', '대한민국 아이돌에서 세계적인 케이팝 스타로 후 Who? K-pop BTS', 12000, 1, 'book_bts.jpg', 6, 8, 3, 'P0001'),
('3860001202', 12, '강진희', '양윤옥', '대한민국 아이돌에서 세계적인 케이팝 스타로 후 Who? K-pop BTS', 12000, 1, 'book_bts.jpg', 6, 8, 3, 'P0001'),
('3860001203', 12, '강진희', '양윤옥', '대한민국 아이돌에서 세계적인 케이팝 스타로 후 Who? K-pop BTS', 12000, 1, 'book_bts.jpg', 6, 8, 3, 'P0001'),
('3860001204', 12, '강진희', '양윤옥', '대한민국 아이돌에서 세계적인 케이팝 스타로 후 Who? K-pop BTS', 12000, 1, 'book_bts.jpg', 6, 8, 3, 'P0001'),
('3860001205', 12, '강진희', '양윤옥', '대한민국 아이돌에서 세계적인 케이팝 스타로 후 Who? K-pop BTS', 12000, 1, 'book_bts.jpg', 6, 8, 3, 'P0001'),
('3860001206', 12, '강진희', '양윤옥', '대한민국 아이돌에서 세계적인 케이팝 스타로 후 Who? K-pop BTS', 12000, 1, 'book_bts.jpg', 6, 8, 3, 'P0001'),
('3860001207', 12, '강진희', '양윤옥', '대한민국 아이돌에서 세계적인 케이팝 스타로 후 Who? K-pop BTS', 12000, 1, 'book_bts.jpg', 6, 8, 3, 'P0001');

insert into proj_library.book values
('5500001301', 13, '재런 러니어', '노승영', '가상 현실의 탄생', 25000, 1, 'book_ai.jpg', 0, 5, 5, 'P0003'),
('5500001302', 13, '재런 러니어', '노승영', '가상 현실의 탄생', 25000, 1, 'book_ai.jpg', 0, 5, 5, 'P0003'),
('5500001303', 13, '재런 러니어', '노승영', '가상 현실의 탄생', 25000, 1, 'book_ai.jpg', 0, 5, 5, 'P0003'),
('5500001304', 13, '재런 러니어', '노승영', '가상 현실의 탄생', 25000, 1, 'book_ai.jpg', 0, 5, 5, 'P0003'),
('5500001305', 13, '재런 러니어', '노승영', '가상 현실의 탄생', 25000, 1, 'book_ai.jpg', 0, 5, 5, 'P0003'),
('5500001306', 13, '재런 러니어', '노승영', '가상 현실의 탄생', 25000, 1, 'book_ai.jpg', 0, 5, 5, 'P0003'),
('5500001307', 13, '재런 러니어', '노승영', '가상 현실의 탄생', 25000, 1, 'book_ai.jpg', 0, 5, 5, 'P0003');
