select * from category_b;

-- 대분류
insert into category_b values
(0, '총류'),
(1, '철학'),
(2, '종교'),
(3, '사회과학'),
(4, '자연과학'),
(5, '기술과학'),
(6, '예술'),
(7, '언어'),
(8, '문학'),
(9, '역사');

select * from category_m;

-- 중뷴류:총류(0)
insert into category_m values
(0, 0, '총류'),
(1, 0, '도서학, 서지학'),
(2, 0, '문헌정보학'),
(3, 0, '백과사전'),
(4, 0, '강연집, 수필집, 연설문집'),
(5, 0, '일반 연속간행물'),
(6, 0, '일반 학회, 단체, 협회, 기관'),
(7, 0, '신문 , 저널리즘'),
(8, 0, '일반전집, 총서'),
(9, 0, '향토자료');

-- 중뷴류:철학(1)
insert into category_m values
(0, 1, '철학'),
(1, 1, '형이상학'),
(2, 1, '인식론, 인과론, 인간학'),
(3, 1, '철학의 세계'),
(4, 1, '경학'),
(5, 1, '동야철학, 사상'),
(6, 1, '서양철학'),
(7, 1, '논리학'),
(8, 1, '심리학'),
(9, 1, '윤리학, 도덕철학');

-- 중뷴류:종교(2)
insert into category_m values
(0, 2, '종교'),
(1, 2, '비교종교'),
(2, 2, '불교'),
(3, 2, '기독교'),
(4, 2, '도교'),
(5, 2, '천도교'),
(7, 2, '힌두교, 브라만교'),
(8, 2, '이슬람교(회교)'),
(9, 2, '기타 제종교');

-- 중뷴류:사회과학(3)
insert into category_m values
(0, 3, '사회과학'),
(1, 3, '통계자료'),
(2, 3, '경제학'),
(3, 3, '사회학, 사회문제'),
(4, 3, '정치학'),
(5, 3, '행정학'),
(6, 3, '법률, 법학'),
(7, 3, '교육학'),
(8, 3, '풍속, 예절, 민속학'),
(9, 3, '국방, 군사학');