insert into proj_library.publisher values
('P0001', 'YES24'),
('P0002', '교보문고'),
('P0003', '학산문학사'),
('P0004', '동아출판'),
('P0005', '가메출판사'),
('P0006', '이지스퍼블리싱');

insert into proj_library.book values
('2220000101', 1, '조제 마우루 지 바스콘셀루스', '이천희', '나의 라임 오렌지 나무', 8000, 1, '나의 라임 오렌지나무.jpg', 2, 2, 2, 'P0001'),
('2220000102', 1, '조제 마우루 지 바스콘셀루스', '이천희', '나의 라임 오렌지 나무', 8000, 1, '나의 라임 오렌지나무.jpg', 2, 2, 2, 'P0001'),
('2220000103', 1, '조제 마우루 지 바스콘셀루스', '이천희', '나의 라임 오렌지 나무', 8000, 1, '나의 라임 오렌지나무.jpg', 2, 2, 2, 'P0001'),
('2220000104', 1, '조제 마우루 지 바스콘셀루스', '이천희', '나의 라임 오렌지 나무', 8000, 1, '나의 라임 오렌지나무.jpg', 2, 2, 2, 'P0001'),
('2220000105', 1, '조제 마우루 지 바스콘셀루스', '이천희', '나의 라임 오렌지 나무', 8000, 1, '나의 라임 오렌지나무.jpg', 2, 2, 2, 'P0001');

insert into proj_library.book values
('0390000201', 2, '한복선', null, '한복선의 친절한 요리책', 16000, 1, '친절한 요리책.jpg', 9, 3, 0, 'P0005'),
('0390000202', 2, '한복선', null, '한복선의 친절한 요리책', 16000, 1, '친절한 요리책.jpg', 9, 3, 0, 'P0005'),
('0390000203', 2, '한복선', null, '한복선의 친절한 요리책', 16000, 1, '친절한 요리책.jpg', 9, 3, 0, 'P0005'),
('0390000204', 2, '한복선', null, '한복선의 친절한 요리책', 16000, 1, '친절한 요리책.jpg', 9, 3, 0, 'P0005'),
('0390000205', 2, '한복선', null, '한복선의 친절한 요리책', 16000, 1, '친절한 요리책.jpg', 9, 3, 0, 'P0005');

insert into proj_library.book values
('5600000301', 3, '정재곤', null, 'Do it! 안드로이드 앱 프로그래밍', 7300, 1, '안드로이드 앱 프로그래밍.jpg', 0, 6, 5, 'P0006'),
('5600000302', 3, '정재곤', null, 'Do it! 안드로이드 앱 프로그래밍', 7300, 1, '안드로이드 앱 프로그래밍.jpg', 0, 6, 5, 'P0006'),
('5600000303', 3, '정재곤', null, 'Do it! 안드로이드 앱 프로그래밍', 7300, 1, '안드로이드 앱 프로그래밍.jpg', 0, 6, 5, 'P0006'),
('5600000304', 3, '정재곤', null, 'Do it! 안드로이드 앱 프로그래밍', 7300, 1, '안드로이드 앱 프로그래밍.jpg', 0, 6, 5, 'P0006'),
('5600000305', 3, '정재곤', null, 'Do it! 안드로이드 앱 프로그래밍', 7300, 1, '안드로이드 앱 프로그래밍.jpg', 0, 6, 5, 'P0006');

insert into proj_library.book values
('6900000401', 4, '앙투안 드 생텍쥐페리', '김재영', '어린 왕자', 9000, 1, '어린 왕자.jpg', 0, 9, 6, 'P0004'),
('6900000402', 4, '앙투안 드 생텍쥐페리', '김재영', '어린 왕자', 9000, 1, '어린 왕자.jpg', 0, 9, 6, 'P0004'),
('6900000403', 4, '앙투안 드 생텍쥐페리', '김재영', '어린 왕자', 9000, 1, '어린 왕자.jpg', 0, 9, 6, 'P0004'),
('6900000404', 4, '앙투안 드 생텍쥐페리', '김재영', '어린 왕자', 9000, 1, '어린 왕자.jpg', 0, 9, 6, 'P0004'),
('6900000405', 4, '앙투안 드 생텍쥐페리', '김재영', '어린 왕자', 9000, 1, '어린 왕자.jpg', 0, 9, 6, 'P0004');

insert into proj_library.book values
('3890000501', 5, '조창인', null, '등대지기', 9000, 1, '등대지기.jpg', 9, 8, 3, 'P0003'),
('3890000502', 5, '조창인', null, '등대지기', 9000, 1, '등대지기.jpg', 9, 8, 3, 'P0003'),
('3890000503', 5, '조창인', null, '등대지기', 9000, 1, '등대지기.jpg', 9, 8, 3, 'P0003'),
('3890000504', 5, '조창인', null, '등대지기', 9000, 1, '등대지기.jpg', 9, 8, 3, 'P0003'),
('3890000505', 5, '조창인', null, '등대지기', 9000, 1, '등대지기.jpg', 9, 8, 3, 'P0003');

insert into proj_library.book values
('1370000601', 6, '셸 실버스타인', '황경수', '아낌없이 주는 나무', 7300, 1, '아낌없이 주는 나무.jpg', 7, 3, 1, 'P0001'),
('1370000602', 6, '셸 실버스타인', '황경수', '아낌없이 주는 나무', 7300, 1, '아낌없이 주는 나무.jpg', 7, 3, 1, 'P0001'),
('1370000603', 6, '셸 실버스타인', '황경수', '아낌없이 주는 나무', 7300, 1, '아낌없이 주는 나무.jpg', 7, 3, 1, 'P0001'),
('1370000604', 6, '셸 실버스타인', '황경수', '아낌없이 주는 나무', 7300, 1, '아낌없이 주는 나무.jpg', 7, 3, 1, 'P0001'),
('1370000605', 6, '셸 실버스타인', '황경수', '아낌없이 주는 나무', 7300, 1, '아낌없이 주는 나무.jpg', 7, 3, 1, 'P0001'),
('1370000606', 6, '셸 실버스타인', '황경수', '아낌없이 주는 나무', 7300, 1, '아낌없이 주는 나무.jpg', 7, 3, 1, 'P0001'),
('1370000607', 6, '셸 실버스타인', '황경수', '아낌없이 주는 나무', 7300, 1, '아낌없이 주는 나무.jpg', 7, 3, 1, 'P0001'),
('1370000608', 6, '셸 실버스타인', '황경수', '아낌없이 주는 나무', 7300, 1, '아낌없이 주는 나무.jpg', 7, 3, 1, 'P0001');

insert into proj_library.book values
('6900000701', 7, '김민수', null, '그림으로 쉽게 설명하는 안드로이드 프로그래밍', 8200, 1, '안드로이드 프로그래밍.jpg', 0, 9, 6, 'P0004'),
('6900000702', 7, '김민수', null, '그림으로 쉽게 설명하는 안드로이드 프로그래밍', 8200, 1, '안드로이드 프로그래밍.jpg', 0, 9, 6, 'P0004'),
('6900000703', 7, '김민수', null, '그림으로 쉽게 설명하는 안드로이드 프로그래밍', 8200, 1, '안드로이드 프로그래밍.jpg', 0, 9, 6, 'P0004');

insert into proj_library.book values
('3990000801', 8, '키시모토 마사시', '김재원', '나루토 67권', 4000, 1, '나루토 67권.jpg', 9, 9, 3, 'P0005'),
('3990000802', 8, '키시모토 마사시', '김재원', '나루토 67권', 4000, 1, '나루토 67권.jpg', 9, 9, 3, 'P0005'),
('3990000803', 8, '키시모토 마사시', '김재원', '나루토 67권', 4000, 1, '나루토 67권.jpg', 9, 9, 3, 'P0005'),
('3990000804', 8, '키시모토 마사시', '김재원', '나루토 67권', 4000, 1, '나루토 67권.jpg', 9, 9, 3, 'P0005'),
('3990000805', 8, '키시모토 마사시', '김재원', '나루토 67권', 4000, 1, '나루토 67권.jpg', 9, 9, 3, 'P0005');

insert into proj_library.book values
('2440000901', 9, '히가시노 게이고', '양윤옥', '나미야 잡화점의 기적', 14800, 1, '나미야 잡화점의 기적.jpg', 4, 4, 2, 'P0002'),
('2440000902', 9, '히가시노 게이고', '양윤옥', '나미야 잡화점의 기적', 14800, 1, '나미야 잡화점의 기적.jpg', 4, 4, 2, 'P0002'),
('2440000903', 9, '히가시노 게이고', '양윤옥', '나미야 잡화점의 기적', 14800, 1, '나미야 잡화점의 기적.jpg', 4, 4, 2, 'P0002'),
('2440000904', 9, '히가시노 게이고', '양윤옥', '나미야 잡화점의 기적', 14800, 1, '나미야 잡화점의 기적.jpg', 4, 4, 2, 'P0002'),
('2440000905', 9, '히가시노 게이고', '양윤옥', '나미야 잡화점의 기적', 14800, 1, '나미야 잡화점의 기적.jpg', 4, 4, 2, 'P0002'),
('2440000906', 9, '히가시노 게이고', '양윤옥', '나미야 잡화점의 기적', 14800, 1, '나미야 잡화점의 기적.jpg', 4, 4, 2, 'P0002'),
('2440000907', 9, '히가시노 게이고', '양윤옥', '나미야 잡화점의 기적', 14800, 1, '나미야 잡화점의 기적.jpg', 4, 4, 2, 'P0002');

insert into proj_library.book values
('1840001001', 10, '스펜서 존슨', '공경희', '내 치즈는 어디에서 왔을까?', 13000, 1, '내 치즈는 어디에서 왔을까.jpg', 4, 8, 1, 'P0002'),
('1840001002', 10, '스펜서 존슨', '공경희', '내 치즈는 어디에서 왔을까?', 13000, 1, '내 치즈는 어디에서 왔을까.jpg', 4, 8, 1, 'P0002'),
('1840001003', 10, '스펜서 존슨', '공경희', '내 치즈는 어디에서 왔을까?', 13000, 1, '내 치즈는 어디에서 왔을까.jpg', 4, 8, 1, 'P0002'),
('1840001004', 10, '스펜서 존슨', '공경희', '내 치즈는 어디에서 왔을까?', 13000, 1, '내 치즈는 어디에서 왔을까.jpg', 4, 8, 1, 'P0002'),
('1840001005', 10, '스펜서 존슨', '공경희', '내 치즈는 어디에서 왔을까?', 13000, 1, '내 치즈는 어디에서 왔을까.jpg', 4, 8, 1, 'P0002'),
('1840001006', 10, '스펜서 존슨', '공경희', '내 치즈는 어디에서 왔을까?', 13000, 1, '내 치즈는 어디에서 왔을까.jpg', 4, 8, 1, 'P0002'),
('1840001007', 10, '스펜서 존슨', '공경희', '내 치즈는 어디에서 왔을까?', 13000, 1, '내 치즈는 어디에서 왔을까.jpg', 4, 8, 1, 'P0002');

insert into proj_library.book values
('3270001101', 11, '성선화', null, '6개월 안에 천만원 모으기', 14800, 1, '6개월 안에 천만원 모으기.jpg', 7, 2, 3, 'P0005'),
('3270001102', 11, '성선화', null, '6개월 안에 천만원 모으기', 14800, 1, '6개월 안에 천만원 모으기.jpg', 7, 2, 3, 'P0005'),
('3270001103', 11, '성선화', null, '6개월 안에 천만원 모으기', 14800, 1, '6개월 안에 천만원 모으기.jpg', 7, 2, 3, 'P0005'),
('3270001104', 11, '성선화', null, '6개월 안에 천만원 모으기', 14800, 1, '6개월 안에 천만원 모으기.jpg', 7, 2, 3, 'P0005'),
('3270001105', 11, '성선화', null, '6개월 안에 천만원 모으기', 14800, 1, '6개월 안에 천만원 모으기.jpg', 7, 2, 3, 'P0005'),
('3270001106', 11, '성선화', null, '6개월 안에 천만원 모으기', 14800, 1, '6개월 안에 천만원 모으기.jpg', 7, 2, 3, 'P0005'),
('3270001107', 11, '성선화', null, '6개월 안에 천만원 모으기', 14800, 1, '6개월 안에 천만원 모으기.jpg', 7, 2, 3, 'P0005');

insert into proj_library.book values
('3860001201', 12, '강진희', null, '대한민국 아이돌에서 세계적인 케이팝 스타로 후 Who? K-pop BTS', 12000, 1, 'BTS.jpg', 6, 8, 3, 'P0001'),
('3860001202', 12, '강진희', null, '대한민국 아이돌에서 세계적인 케이팝 스타로 후 Who? K-pop BTS', 12000, 1, 'BTS.jpg', 6, 8, 3, 'P0001'),
('3860001203', 12, '강진희', null, '대한민국 아이돌에서 세계적인 케이팝 스타로 후 Who? K-pop BTS', 12000, 1, 'BTS.jpg', 6, 8, 3, 'P0001'),
('3860001204', 12, '강진희', null, '대한민국 아이돌에서 세계적인 케이팝 스타로 후 Who? K-pop BTS', 12000, 1, 'BTS.jpg', 6, 8, 3, 'P0001'),
('3860001205', 12, '강진희', null, '대한민국 아이돌에서 세계적인 케이팝 스타로 후 Who? K-pop BTS', 12000, 1, 'BTS.jpg', 6, 8, 3, 'P0001'),
('3860001206', 12, '강진희', null, '대한민국 아이돌에서 세계적인 케이팝 스타로 후 Who? K-pop BTS', 12000, 1, 'BTS.jpg', 6, 8, 3, 'P0001'),
('3860001207', 12, '강진희', null, '대한민국 아이돌에서 세계적인 케이팝 스타로 후 Who? K-pop BTS', 12000, 1, 'BTS.jpg', 6, 8, 3, 'P0001');

insert into proj_library.book values
('5500001301', 13, '재런 러니어', '노승영', '가상 현실의 탄생', 25000, 1, '가상 현실의 탄생.jpg', 0, 5, 5, 'P0003'),
('5500001302', 13, '재런 러니어', '노승영', '가상 현실의 탄생', 25000, 1, '가상 현실의 탄생.jpg', 0, 5, 5, 'P0003'),
('5500001303', 13, '재런 러니어', '노승영', '가상 현실의 탄생', 25000, 1, '가상 현실의 탄생.jpg', 0, 5, 5, 'P0003'),
('5500001304', 13, '재런 러니어', '노승영', '가상 현실의 탄생', 25000, 1, '가상 현실의 탄생.jpg', 0, 5, 5, 'P0003'),
('5500001305', 13, '재런 러니어', '노승영', '가상 현실의 탄생', 25000, 1, '가상 현실의 탄생.jpg', 0, 5, 5, 'P0003'),
('5500001306', 13, '재런 러니어', '노승영', '가상 현실의 탄생', 25000, 1, '가상 현실의 탄생.jpg', 0, 5, 5, 'P0003'),
('5500001307', 13, '재런 러니어', '노승영', '가상 현실의 탄생', 25000, 1, '가상 현실의 탄생.jpg', 0, 5, 5, 'P0003');

insert into proj_library.book values
('4500001401', 14, '히가시노 게이고', '김난주', '가면산장 살인사건', 14800, 1, '가면산장 살인사건.jpg', 0, 5, 4, 'P0005'),
('4500001402', 14, '히가시노 게이고', '김난주', '가면산장 살인사건', 14800, 1, '가면산장 살인사건.jpg', 0, 5, 4, 'P0005'),
('4500001403', 14, '히가시노 게이고', '김난주', '가면산장 살인사건', 14800, 1, '가면산장 살인사건.jpg', 0, 5, 4, 'P0005'),
('4500001404', 14, '히가시노 게이고', '김난주', '가면산장 살인사건', 14800, 1, '가면산장 살인사건.jpg', 0, 5, 4, 'P0005'),
('4500001405', 14, '히가시노 게이고', '김난주', '가면산장 살인사건', 14800, 1, '가면산장 살인사건.jpg', 0, 5, 4, 'P0005'),
('4500001406', 14, '히가시노 게이고', '김난주', '가면산장 살인사건', 14800, 1, '가면산장 살인사건.jpg', 0, 5, 4, 'P0005'),
('4500001407', 14, '히가시노 게이고', '김난주', '가면산장 살인사건', 14800, 1, '가면산장 살인사건.jpg', 0, 5, 4, 'P0005');

insert into proj_library.book values
('7000001501', 15, '혜민', null, '고요할수록 밝아지는 것들', 15000, 1, '고요할수록 밝아지는 것들.jpg', 0, 0, 7, 'P0002'),
('7000001502', 15, '혜민', null, '고요할수록 밝아지는 것들', 15000, 1, '고요할수록 밝아지는 것들.jpg', 0, 0, 7, 'P0002');

insert into proj_library.book values
('8000001601', 16, '조던 B. 피터슨', '메이븐', '12가지 인생의 법칙', 16800, 1, '12가지 인생의 법칙.jpg', 0, 0, 8, 'P0003'),
('8000001602', 16, '조던 B. 피터슨', '메이븐', '12가지 인생의 법칙', 16800, 1, '12가지 인생의 법칙.jpg', 0, 0, 8, 'P0003');

insert into proj_library.book values
('9000001701', 17, '김난도',null, '트렌드 코리아 2019', 17000, 1, '트렌드 코리아 2019.jpg', 0, 0, 9, 'P0003'),
('9000001702', 17, '김난도',null, '트렌드 코리아 2019', 17000, 1, '트렌드 코리아 2019.jpg', 0, 0, 9, 'P0003');

insert into proj_library.book values
('1180001801', 18, '마당쇠', '마당쇠', '마님은 왜 돌쇠에게만 쌀밥을 주었는가?', 9900, 1, 'book_manim.jpg', 8, 1, 1, 'P0001'),
('1180001802', 18, '마당쇠', '마당쇠', '마님은 왜 돌쇠에게만 쌀밥을 주었는가?', 9900, 1, 'book_manim.jpg', 8, 1, 1, 'P0001'),
('1180001803', 18, '마당쇠', '마당쇠', '마님은 왜 돌쇠에게만 쌀밥을 주었는가?', 9900, 1, 'book_manim.jpg', 8, 1, 1, 'P0001'),
('1180001804', 18, '마당쇠', '마당쇠', '마님은 왜 돌쇠에게만 쌀밥을 주었는가?', 9900, 1, 'book_manim.jpg', 8, 1, 1, 'P0001'),
('1180001805', 18, '마당쇠', '마당쇠', '마님은 왜 돌쇠에게만 쌀밥을 주었는가?', 9900, 1, 'book_manim.jpg', 8, 1, 1, 'P0001');

insert into proj_library.book values
('1180001901', 19, '마당쇠', '마당쇠', '마님은 왜 돌쇠에게만 고깃국을 주었는가?', 9900, 1, 'book_manim.jpg', 8, 1, 1, 'P0001'),
('1180001902', 19, '마당쇠', '마당쇠', '마님은 왜 돌쇠에게만 고깃국을 주었는가?', 9900, 1, 'book_manim.jpg', 8, 1, 1, 'P0001'),
('1180001903', 19, '마당쇠', '마당쇠', '마님은 왜 돌쇠에게만 고깃국을 주었는가?', 9900, 1, 'book_manim.jpg', 8, 1, 1, 'P0001'),
('1180001904', 19, '마당쇠', '마당쇠', '마님은 왜 돌쇠에게만 고깃국을 주었는가?', 9900, 1, 'book_manim.jpg', 8, 1, 1, 'P0001'),
('1180001905', 19, '마당쇠', '마당쇠', '마님은 왜 돌쇠에게만 고깃국을 주었는가?', 9900, 1, 'book_manim.jpg', 8, 1, 1, 'P0001');


insert into proj_library.book values
('1180002001', 20, '마당쇠', '마당쇠', '마님은 왜 돌쇠에게만 술을 주었는가?', 9900, 1, 'book_manim.jpg', 8, 1, 1, 'P0001'),
('1180002002', 20, '마당쇠', '마당쇠', '마님은 왜 돌쇠에게만 술을 주었는가?', 9900, 1, 'book_manim.jpg', 8, 1, 1, 'P0001'),
('1180002003', 20, '마당쇠', '마당쇠', '마님은 왜 돌쇠에게만 술을 주었는가?', 9900, 1, 'book_manim.jpg', 8, 1, 1, 'P0001'),
('1180002004', 20, '마당쇠', '마당쇠', '마님은 왜 돌쇠에게만 술을 주었는가?', 9900, 1, 'book_manim.jpg', 8, 1, 1, 'P0001'),
('1180002005', 20, '마당쇠', '마당쇠', '마님은 왜 돌쇠에게만 술을 주었는가?', 9900, 1, 'book_manim.jpg', 8, 1, 1, 'P0001');

